# Pandas

In [79]:
import pandas as pd
import numpy as np

In [80]:
df = pd.DataFrame(np.arange(0,20).reshape(5,4),index=['Row1','Row2','Row3','Row4','Row5'],columns=["Column1","Column2","Column3","Column4"])

In [81]:
df.head()

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [18]:
df.to_csv('Test.csv')

In [82]:
# Accessing the elements by .loc
df.loc['Row1']

Column1    0
Column2    1
Column3    2
Column4    3
Name: Row1, dtype: int32

In [83]:
df.loc['Row1']

Column1    0
Column2    1
Column3    2
Column4    3
Name: Row1, dtype: int32

In [20]:
type(df.loc['Row1'])

pandas.core.series.Series

In [56]:
# Columns can be accessed directly
df['Column1']

Row1     0
Row2     4
Row3     8
Row4    12
Row5    16
Name: Column1, dtype: int32

In [59]:
df[['Column1', 'Column2']] # get mutiple columns

      Column1  Column2
Row1        0        1
Row2        4        5
Row3        8        9
Row4       12       13
Row5       16       17

In [60]:
# Accessing the elements by .iloc (index location)
df.iloc[:,:]

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [61]:
df.iloc[0:2,0:2]

      Column1  Column2
Row1        0        1
Row2        4        5

In [62]:
type(df.iloc[0:2,0:2]) # If there are mutiple rows or mutiple columns, it would be a DataFrame

pandas.core.frame.DataFrame

In [63]:
df.iloc[0:2,0:1] # this is also a DataFrame

      Column1
Row1        0
Row2        4

In [64]:
df.iloc[0:2,0] # this would be Series

Row1    0
Row2    4
Name: Column1, dtype: int32

In [65]:
# if you provide a discrete value for either rows or columns it will become Series
# but if provide range for both rows and columns, it will become DataFrames

In [66]:
df.iloc[:,1:]

      Column2  Column3  Column4
Row1        1        2        3
Row2        5        6        7
Row3        9       10       11
Row4       13       14       15
Row5       17       18       19

In [67]:
# convert DataFrames into array
df.iloc[:,1:].values

array([[ 1,  2,  3],
       [ 5,  6,  7],
       [ 9, 10, 11],
       [13, 14, 15],
       [17, 18, 19]])

In [68]:
df.isnull() # will check null values

      Column1  Column2  Column3  Column4
Row1    False    False    False    False
Row2    False    False    False    False
Row3    False    False    False    False
Row4    False    False    False    False
Row5    False    False    False    False

In [69]:
df.isnull().sum() # will add along rows

Column1    0
Column2    0
Column3    0
Column4    0
dtype: int64

In [70]:
df

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [71]:
df['Column1'].value_counts() # will return the Column1 value's count

12    1
4     1
16    1
8     1
0     1
Name: Column1, dtype: int64

In [72]:
df.loc['Row1'].value_counts() # will return the Row1 value's count

3    1
2    1
1    1
0    1
Name: Row1, dtype: int64

In [73]:
df['Column1'].unique() # will get unique values

array([ 0,  4,  8, 12, 16])